import {Heading} from '@/components/ui/heading';
import {Text} from '@/components/ui/text';
import {UserAgreementProps} from '@/routes/types'; // 假设是你在routes/types里定义的类型
import React from 'react';
import {ScrollView} from 'react-native';

const UserAgreementScreen: React.FC<UserAgreementProps> = () => {
  return (
    <ScrollView contentContainerStyle={{padding: 16}}>
      {/* 标题 */}
      <Heading size="2xl">用户协议及服务条款</Heading>

      {/* 引言部分 */}
      <Text style={{marginTop: 16, fontSize: 16}}>
        本政策仅适用于{'mmdxiaoxin'}的{`病虫害智能诊断系统`}产品或服务。
        最近更新日期：
        {`${new Date().getFullYear()}年${new Date().getMonth()}月${new Date().getDate()}日`}
      </Text>

      {/* 章节 1 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        一、我们如何收集和使用您的用户信息
      </Text>
      <Text style={{marginTop: 10}}>
        （一）您使用我司产品或服务过程中我们收集和使用的信息
        我们仅会出于本政策所述的业务功能，收集和使用您的用户信息，收集用户信息的目的在于向您提供产品或服务，您有权自行选择是否提供该信息，但多数情况下，如果您不提供，我们可能无法向您提供相应的服务，也无法回应您遇到的问题。
      </Text>

      <Text style={{marginTop: 10}}>
        （二）征得授权同意的例外
        请您理解，根据法律法规及相关国家标准，以下情形中，我们收集和使用您的用户信息无需征得您的授权同意：
        1. 与国家安全、国防安全直接相关的； 2.
        与公共安全、公共卫生、重大公共利益直接相关的； 3.
        与犯罪侦查、起诉、审判和判决执行等直接相关的； 4.
        出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
        ...
      </Text>

      {/* 章节 2 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        二、我们如何使用 Cookie 和同类技术
      </Text>
      <Text style={{marginTop: 10}}>
        （一）Cookie 为确保网站正常运转，我们会在您的计算机或移动设备上存储名为
        Cookie 的小数据文件。Cookie
        通常包含标识符、站点名称以及一些号码和字符。借助于
        Cookie，网站能够存储您的访问偏好数据。 我们不会将 Cookie
        用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除
        Cookie。您可以清除计算机上保存的所有 Cookie，大部分网络浏览器都设有阻止
        Cookie
        的功能。但如果您这么做，则需要在每一次访问我们的网站时亲自更改用户设置。
      </Text>
      <Text style={{marginTop: 10}}>
        （二）网站信标和像素标签 除 Cookie
        外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的点击URL。
        如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
      </Text>
      <Text style={{marginTop: 10}}>
        （三）Do Not Track（请勿追踪） 很多网络浏览器均设有Do Not
        Track功能，该功能可向网站发布Do Not
        Track请求。目前，主要互联网标准组织尚未设立相关政策来规定网站应如何应对此类请求。但如果您的浏览器启用了
        Do Not Track，那么我们的所有网站都会尊重您的选择。
      </Text>

      {/* 章节 3 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        三、我们如何共享、转让、公开披露您的用户信息
      </Text>

      {/* 共享部分 */}
      <Text style={{marginTop: 10, fontSize: 18, fontWeight: 'bold'}}>
        （一）共享
      </Text>
      <Text style={{marginTop: 10}}>
        我们不会与其他的任何公司、组织和个人分享您的用户信息，但以下情况除外：
        {'\n'}
        1、在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的用户信息。
        {'\n'}
        2、根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的用户信息。
        {'\n'}
        3、与我们的关联公司共享：您的用户信息可能会与我们的关联公司共享。我们只会共享必要的用户信息，且受本隐私政策中所声明目的的约束。
        {'\n'}
        4、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的某些用户信息，以提供更好的客户服务和用户体验。
        {'\n'}
        为了更好运营和改善技术和服务，您同意我们和授权合作伙伴在符合相关法律法规的前提下可将收集的信息用于其他服务和用途。
        {'\n'}例如：
        {'\n'}（1）消息推送服务供应商：由每日互动股份有限公司提供推送技术服务。
        {'\n'}（2）广告、媒体：我们可能会将收集到的信息共享给广告、媒体等。
      </Text>

      {/* 转让部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （二）转让
      </Text>
      <Text style={{marginTop: 10}}>
        我们不会将您的用户信息转让给任何公司、组织和个人，但以下情况除外：
        {'\n'}
        1、在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的用户信息；
        {'\n'}
        2、在涉及合并、收购或破产清算时，用户信息可能会被转让给新的持有方，我们将要求该公司继续受本隐私政策的约束，或者重新向您征求授权同意。
      </Text>

      {/* 公开披露部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （三）公开披露
      </Text>
      <Text style={{marginTop: 10}}>
        我们仅会在以下情况下，公开披露您的用户信息：
        {'\n'}1、获得您明确同意后；
        {'\n'}
        2、基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的用户信息。
      </Text>

      {/* 授权同意的例外部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （四）共享、转让、公开披露信息时事先征得授权同意的例外
      </Text>
      <Text style={{marginTop: 10}}>
        请您理解，根据法律法规及相关国家标准，以下情形中，我们共享、转让、公开披露您的用户信息无需征得您的授权同意：
        {'\n'}1、与国家安全、国防安全直接相关的；
        {'\n'}2、与公共安全、公共卫生、重大公共利益直接相关的；
        {'\n'}3、与犯罪侦查、起诉、审判和判决执行等直接相关的；
        {'\n'}
        4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
        {'\n'}5、您自行向社会公众公开的信息；
        {'\n'}
        6、从合法公开披露的信息中收集的，如合法的新闻报道、政府信息公开等渠道。
      </Text>

      {/* 章节 4 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        四、我们如何保护您的用户信息
      </Text>

      {/* 安全防护措施部分 */}
      <Text style={{marginTop: 10}}>
        （一）我们已使用符合业界标准的安全防护措施保护您提供的用户信息，防止数据遭到未经授权的访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的用户信息。例如，在您的浏览器与“服务”之间交换数据时受
        SSL 加密保护；我们同时对网站提供 https
        安全浏览方式；我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击；我们会部署访问控制机制，确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。
      </Text>

      {/* 认证部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （二）我们已经取得了以下认证：
      </Text>
      <Text style={{marginTop: 10}}>{`公司获取的相关认证内容`}</Text>

      {/* 数据安全能力部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （三）我们的数据安全能力：
      </Text>
      <Text style={{marginTop: 10}}>{`公司的数据安全能力描述`}</Text>

      {/* 信息收集与保留部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （四）信息收集与保留：
      </Text>
      <Text style={{marginTop: 10}}>
        我们会采取一切合理可行的措施，确保未收集无关的用户信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非需要延长保留期或受到法律的允许。
      </Text>

      {/* 信息传输安全部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （五）互联网安全：
      </Text>
      <Text style={{marginTop: 10}}>
        互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送用户信息。
      </Text>

      {/* 风险公开部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （六）风险公开：
      </Text>
      <Text style={{marginTop: 10}}>
        我们将定期更新并公开安全风险、用户信息安全影响评估等报告的有关内容。您可通过以下方式获得：补充安全风险公开途径。
      </Text>

      {/* 安全事件风险部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （七）安全事件风险：
      </Text>
      <Text style={{marginTop: 10}}>
        互联网环境并非百分之百安全，我们将尽力确保您发送给我们的任何信息的安全性。即使我们做出了很大努力，采取了一切合理且必要的措施，仍然有可能无法杜绝您的用户信息被非法访问、被非法盗取，被非法篡改或毁坏，导致您的合法权益受损，请您理解信息网络的上述风险并自愿承担。
      </Text>

      {/* 信息安全事件通知部分 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （八）信息安全事件通知：
      </Text>
      <Text style={{marginTop: 10}}>
        在不幸发生用户信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知用户信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报用户信息安全事件的处置情况。
      </Text>

      {/* 章节 5 */}
      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        五、您的权利
      </Text>

      {/* 引言部分 */}
      <Text style={{marginTop: 16, fontSize: 16}}>
        按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的用户信息行使以下权利：
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （一）访问您的用户信息
      </Text>
      <Text style={{marginTop: 10}}>
        您有权访问您的用户信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问：补充用户信息访问方式。
        如果您无法通过上述链接访问这些用户信息，您可以随时使用我们的 Web
        表单联系，或发送电子邮件至{`公司邮箱`}。我们将在30天内回复您的访问请求。
        对于您在使用我们的产品或服务过程中产生的其他用户信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，请发送电子邮件至
        {`公司邮箱`}。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （二）更正您的用户信息
      </Text>
      <Text style={{marginTop: 10}}>
        当您发现我们处理的关于您的用户信息有错误时，您有权要求我们作出更正。您可以通过“（一）访问您的用户信息”中罗列的方式提出更正申请。如果您无法通过上述链接更正这些用户信息，您可以随时使用我们的
        Web 表单联系，或发送电子邮件至{`公司邮箱`}
        。我们将在30天内回复您的更正请求。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （三）删除您的用户信息
      </Text>
      <Text style={{marginTop: 10}}>
        在以下情形中，您可以向我们提出删除用户信息的请求：
        1、如果我们处理用户信息的行为违反法律法规；
        2、如果我们收集、使用您的用户信息，却未征得您的同意；
        3、如果我们处理用户信息的行为违反了与您的约定；
        4、如果您不再使用我们的产品或服务，或您注销了账号；
        5、如果我们不再为您提供产品或服务。
        我们将会根据您的删除请求进行评估，若满足相应规定，我们将会采取相应步骤进行处理。当您向我们提出删除请求时，我们可能会要求您进行身份验证，以保障账户的安全。当您从我们的服务中删除信息后，因为适用的法律和安全技术，我们可能不会立即从备份系统中删除相应的信息，我们将安全存储您的信息直到备份可以清除或实现匿名化。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （四）改变您授权同意的范围
      </Text>
      <Text style={{marginTop: 10}}>
        每个业务功能需要一些基本的用户信息才能得以完成（见本政策“第一部分”）。对于用户信息的收集和使用，您可以随时给予或收回您的授权同意。您可以通过以下方式自行操作：补充改变用户信息的访问方式。
        当您收回同意后，我们将不再处理相应的用户信息。同时也请您注意，您撤销授权同意可能会导致某些后果，例如我们可能无法继续为您提供相应的服务或特定的功能，但您收回同意的决定，不会影响此前基于您的授权而开展的用户信息处理。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （五）用户信息主体注销账户
      </Text>
      <Text style={{marginTop: 10}}>
        您随时可注销此前注册的账户，您可以通过以下方式自行操作：补充注销账户的操作方式。
        在注销账户之后，我们将停止为您提供产品或服务并依据您的要求，删除或匿名化您的信息，法律法规另有规定的除外。这也将可能导致您失去对您账户中数据的访问权，请您谨慎操作。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （六）用户信息主体获取用户信息副本
      </Text>
      <Text style={{marginTop: 10}}>
        您有权获取您的用户信息副本，您可以通过以下方式自行操作：补充获取用户信息副本的操作方式。
        在技术可行的前提下，例如数据接口匹配，我们还可按您的要求，直接将您的用户信息副本传输给您指定的第三方。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （七）约束信息系统自动决策
      </Text>
      <Text style={{marginTop: 10}}>
        在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作出解释，我们也将提供适当的救济方式。
      </Text>

      <Text style={{marginTop: 20, fontSize: 18, fontWeight: 'bold'}}>
        （八）响应您的上述请求
      </Text>
      <Text style={{marginTop: 10}}>
        为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。
        我们将在三十天内作出答复。如您不满意，还可以通过以下途径投诉：补充其他的申诉途径。
        对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情况收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。也请您理解，出于安全保障的考虑、相关法律法规的要求或技术上的限制，对于您的某些请求我们可能无法做出响应，例如以下情形：
        {'\n'}1、与用户信息控制者履行法律法规规定的义务相关的；
        {'\n'}2、与国家安全、国防安全直接相关的；
        {'\n'}3、与公共安全、公共卫生、重大公共利益直接相关的；
        {'\n'}4、与犯罪侦查、起诉、审判和执行判决等直接相关的；
        {'\n'}
        5、用户信息控制者有充分证据表明用户信息主体存在主观恶意或滥用权利的；
        {'\n'}
        6、出于维护用户信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
        {'\n'}
        7、响应用户信息主体的请求将导致用户信息主体或其他个人、组织的合法权益受到严重损害的；
        {'\n'}8、涉及商业秘密的。
      </Text>
    </ScrollView>
  );
};

export default UserAgreementScreen;
